Assignment2/convertFahrenheitToKelvin-request.xml

<?xml version="1.0"?>

<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">

<soap:Body xmlns:m="http://www.example.org/converter">
  <m:convertFahrenheitToKelvin>
    <m:Fahrenheit>78.08</m:Fahrenheit>
  </m:convertFahrenheitToKelvin>
</soap:Body>

</soap:Envelope>
